#### Exploratory data analysis with Pandas

In this task you should use Pandas to answer a few questions about the [Adult](https://archive.ics.uci.edu/ml/datasets/adult) dataset.

In [1]:
# Load the required library
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [22]:
# load the dataset
df = pd.read_csv("../data/adult.data.csv")

#### Explore the data

In [3]:
# How many rows and cols
print(df.shape)

(32561, 15)

In [23]:
# shpw the column names
print(df.columns)

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [51]:
# Lower case the column headers
# Reference: https://stackoverflow.com/questions/19726029/how-can-i-make-pandas-dataframe-column-headers-all-lowercase.
#df.columns = map(str.lower, df.columns)

We can use the `info()` method to output some general information about the dataframe. The `info()` method in pandas can be considered equivalent to `str()` in R.

Similarly, for categorical variable, the `levels()` function in R EQUIVALENT in Python is `unique()`

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB
None

In [7]:
# see the first 5 lines of data
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

##### 1. How many men and women (sex feature) are represented in this dataset?

In [8]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

##### To calculate fractions, pass `normalize=TRUE`

In [9]:
df['sex'].value_counts(normalize=True)

Male      0.669205
Female    0.330795
Name: sex, dtype: float64

### GroupBy

Reference: See this [SO post](https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation-how-are-they-different)

#### .loc selects data only by labels

There are three different inputs you can use for .loc

- A string
- A list of strings
- Slice notation using strings as the start and stop values

To select a single row of data, place the index label inside of the brackets following .loc. 

Note: `df.loc['sex']` will raise an error, `KeyError: the label [sex] is not in the [index]` because *its in the columns*. When you use `loc`, the first argument is for index. Therefore, you should use `df.loc[:, 'name']`. See this [SO post](https://stackoverflow.com/questions/44352271/label-not-in-list-and-keyerror).

##### Selecting multiple sequential columns with .loc with a list of strings
`df.loc[:,'name1']`

##### Selecting multiple sequential columns with .loc with slice notation
`df.loc[:,'name1':'name3']`

##### Selecting multiple arbitary columns with .loc with slice notation
`df.loc[['name3','name1','name10']]`

In [40]:
df.loc[:,'sex'].head()

0      Male
1      Male
2      Male
3      Male
4    Female
Name: sex, dtype: object

In [48]:
df.loc[:,'race':'sex'].head()

    race     sex
0  White    Male
1  White    Male
2  White    Male
3  Black    Male
4  Black  Female

##### Selecting multiple arbitary columns without .loc notation

In [52]:
df[['race','sex','native-country']].head()

    race     sex native-country
0  White    Male  United-States
1  White    Male  United-States
2  White    Male  United-States
3  Black    Male  United-States
4  Black  Female           Cuba

##### Selecting multiple arbitary columns with `.loc()` notation

In [54]:
df.loc[:,['race','sex','native-country']].head()

    race     sex native-country
0  White    Male  United-States
1  White    Male  United-States
2  White    Male  United-States
3  Black    Male  United-States
4  Black  Female           Cuba

#### 2. What is the average age (age feature) of women?

Will use the function `loc` here. `loc` gets rows (or columns) with particular labels from the index. `iloc` gets rows (or columns) at particular positions in the index (so it only takes integers).

In [10]:
df.loc[df['sex']=='Female','age'].mean()

36.85823043357163

#### 3. What is the percentage of German citizens (native-country feature)?

In [17]:
float( (df['native-country']=='Germany').sum())/df.shape[0]

0.004207487485028101

#### 4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

In [18]:
age1 = df.loc[df['salary']== '>50K','age']

In [19]:
age2 = df.loc[df['salary']== '<=50K','age']

In [55]:
print("The average age of rich {0} and std deviation is {1}.... however the average age of poor is {2}, and standard deviation is {3}".\
      format(age1.mean(), age1.std(), age2.mean(), age2.std()
            )
     )

The average age of rich 44.24984058155847 and std deviation is 10.51902771985177.... however the average age of poor is 36.78373786407767, and standard deviation is 14.020088490824813

#### 6. Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [93]:
df.loc[df['salary']== '>50K','education'].unique()

array(['HS-grad', 'Masters', 'Bachelors', 'Some-college', 'Assoc-voc',
       'Doctorate', 'Prof-school', 'Assoc-acdm', '7th-8th', '12th',
       '10th', '11th', '9th', '5th-6th', '1st-4th'], dtype=object)

#### 7. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In general, grouping data in Pandas works as follows:

`df.groupby(by=grouping_columns)[columns_to_show].function()`

In [97]:
df.groupby(by=['race','sex'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

The `max` age of `Amer-Indian-Eskimo` man is 82

#### 8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [ ]:
df.groupby(by="marital-status")

#### 9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

#### 10. Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?